import random

won, won_now, user_answ, answer, want_again = 0, 0, "true", "false", "ДА"
hint50, hint2, hintChange = True, True, True
hint50istrue, hint2istrue, incorrect_answer = False, False, False

def question(NQ, QList, Q1, Q2, Q3, a1, b1, c1, d1, a2, b2, c2, d2, a3, b3, c3, d3, Asw1, Asw2, Asw3, HChange, H50, H2):
	global user_answ, answer, incorrect_answer, hint50istrue, hint2istrue, won_now
	random.shuffle(QList)
	if NQ == 1:
		price_text = "500 руб."
		lose_text = "0 руб."
		price = 500
		lose = 0
	elif NQ == 2:
		price_text = "1 000 руб."
		lose_text = "0 руб."
		price = 1000
		lose = 0
	elif NQ == 3:
		price_text = "2 000 руб."
		lose_text = "0 руб."
		price = 2000
		lose = 0
	elif NQ == 4:
		price_text = "3 000 руб."
		lose_text = "0 руб."
		price = 3000
		lose = 0
	elif NQ == 5:
		price_text = "5 000 руб. - первая несгораемая сумма!"
		lose_text = "0 руб."
		price = 5000
		lose = 0
	elif NQ == 6:
		price_text = "10 000 руб."
		lose_text = "5 000 руб."
		price = 10000
		lose = 5000
	elif NQ == 7:
		price_text = "15 000 руб."
		lose_text = "5 000 руб."
		price = 15000
		lose = 5000
	elif NQ == 8:
		price_text = "25 000 руб."
		lose_text = "5 000 руб."
		price = 25000
		lose = 5000
	elif NQ == 9:
		price_text = "50 000 руб."
		lose_text = "5 000 руб."
		price = 50000
		lose = 5000
	elif NQ == 10:
		price_text = "100 000 руб. - вторая несгораемая сумма!"
		lose_text = "5 000 руб."
		price = 100000
		lose = 5000
	elif NQ == 11:
		price_text = "200 000 руб."
		lose_text = "100 000 руб."
		price = 200000
		lose = 100000
	elif NQ == 12:
		price_text = "400 000 руб."
		lose_text = "100 000 руб."
		price = 400000
		lose = 100000
	elif NQ == 13:
		price_text = "800 000 руб."
		lose_text = "100 000 руб."
		price = 800000
		lose = 100000
	elif NQ == 14:
		price_text = "1 500 000 руб."
		lose_text = "100 000 руб."
		price = 1500000
		lose = 100000
	elif NQ == 15:
		price_text = "3 000 000 руб."
		lose_text = "100 000 руб."
		price = 3000000
		lose = 100000

	print("\nВопрос №" + str(NQ) +". Стоимость: " + price_text)

	if QList[0] == Q1:
		a = a1
		b = b1
		c = c1
		d = d1
		answer = Asw1
	elif QList[0] == Q2:
		a = a2
		b = b2
		c = c2
		d = d2
		answer = Asw2
	elif QList[0] == Q3:
		a = a3
		b = b3
		c = c3
		d = d3
		answer = Asw3

	if incorrect_answer:
		if user_answ == "A" or user_answ == "А":
			a = ""
		elif user_answ == "B" or user_answ == "В":
			b = ""
		elif user_answ == "C" or user_answ == "С":
			c = ""
		elif user_answ == "D":
			d = ""
		hint2istrue = False

	if hint50istrue:
		if answer[0] == "A":
			c, d = "", ""
		elif answer[0] == "B":
			a, d = "", ""
		elif answer[0] == "C":
			a, b = "", ""
		elif answer[0] == "D":
			a, c = "", ""

	print(QList[0])
	print("A - " + a)
	print("B - " + b)
	print("C - " + c)
	print("D - " + d)
	user_answ = input("\nВаш ответ: ")
	user_answ = user_answ.upper()
	if user_answ == answer[0] or user_answ == answer[1]:
		print("\nПоздравляем! Ваш выигрыш: " + price_text)
		won_now = price
		hint50istrue = False
		hint2istrue = False
		if NQ == 15:
			exit()
	elif user_answ == "Q":
		input("Вы решили уйти из игры, забрав с собой деньги! Ваш выигрыш: 500 руб.")
		exit()
	elif user_answ == "СМЕНА" and HChange:
		print("Вопрос сменён!")
		QList[0] = QList[1]
		HChange = False
	elif user_answ == "СМЕНА" and not HChange:
		print("К сожалению, подсказка Смена вопроса была уже использована!")
	elif user_answ == "50" and H50:
		print("Два заведомо неверных ответа были убраны!")
		hint50istrue = True
		H50 = False
	elif user_answ == "50" and not H50:
		print("К сожалению, подсказка 50:50 была уже использована!")
	elif user_answ == "2" and H2:
		print("Вам дано Право на ошибку!")
		H2 = False
		hint2istrue = True
	elif user_answ == "2" and not H2:
		print("К сожалению, вы уже использовали Право на ошибку!")
	else:
		if hint2istrue:
			print("Это неверный ответ! Вам дан второй шанс!")
			print("Если вы сейчас ответите неверно, то вы проиграете!")
			incorrect_answer = True
		else:
			print("\nК сожалению, вы проиграли! Ваш выигрыш: " + lose_text)
			input("Правильный ответ: " + answer[0])
			exit()

	user_answ, answer = "true", "false"

	return [HChange, H50, H2]


print('ПКШоу "Кто хочет стать миллионером?"')
print("Правила игры:")
print("Вашей задачей будет пройти 15 вопросов, состоящих из 4 ответов. Постепенно вы будете зарабатывать виртуальный приз.")
print("Также вы можете воспользоваться подзказками, вводя их в поле ответа: ")
print("Q - вы уходите из игры, сохраняя ваш приз; \n50 - подсказка 50:50 убирает два заведомо неверных ответа; \n2 - двойной ответ, дающий возможность ответить на вопрос дважды; \nСмена - смена текущего вопроса на другой, при этом вы не продвигаетесь дальше;")
print("Вы можете пользоваться всеми подсказками, но только один раз.")
input("Начнём?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n")



question_1 = ["Что растёт на огороде?", "Какое название телеканала верное?", "Сколько ног у паукообразных?"]
question_2 = ['Назовите сокращённое название "маршрутного такси".', "Назовите популярного стихотворца.",
			  'Какого персонажа нет в известной считалке "На золотом крыльце сидели"?']
question_3 = ['Назовите название популярной телепередачи на 1 канале. "Что? Где?..."',
			  "Какой телеканал существует на самом деле?",
			  "Где, если верить пословице, любопытной Варваре нос оторвали?"]
question_4 = ["Какой отряд птиц не умеет летать?", "Какой предел медицинского градусника?",
			  "Сколько хромосом у среднестатистического человека?"]
question_5 = ["Кто из 4-ёх мушкетёров был не назван? Атос, Д'Артаньян, Партос...", "Назовите формулу воды.",
			  "Какую обувь приобрёл к зиме Шарик из мультфильма про Простоквашино?"]
question_6 = ["Назовите годы правления Михаила Фёдоровича Романова.",
			  "Когда произрошло Первое Московское ополчение?",
			  "Когда произшло крщение на Руси?"]
question_7 = ["К какому семейству птиц относится снегирь?",
			  "Что испанцы съедают в новогоднюю полночь с каждым ударом часов?",
			  "В какую одежду принято плакать, чтобы вызвать сочувствие?"]
question_8 = ["На практике при движении по кривой этот шарик делает 5000 оборотов в минуту, а при движении по прямой более 20000 оборотов в минуту. Где этот шарик находится?",
			  'Как звали почтальона Печкина из мультфильма "Трое из Простоквашино"?',
			  "Каким предметом китайцы стараются не пользоваться в преддверии Нового года, чтобы не разрушить счастья?"]
question_9 = ["Из какого мяса традиционно готовится начинка для чебуреков?",
			  "Изучение соединений какого элемента является основой органической химии?",
			  "Разновидностью какого минерала является горный хрусталь?"]
question_10 = ["В какое море впадает река Урал?", "Как называется шуточная поэма Пушкина?",
			   "С каким из этих государств не граничит Россия?"]
question_11 = ["Как называется метеорный поток, наблюдаемый ежегодно в ноябре?",
			   "Как называется балет Дмитрия Шостоковича на производственную тематику?",
			   "Какого цвета были первые советские скафандры для космонавтов?"]
question_12 = ["Чего боится охлофоб?",
			   "В кого богиня Афина превратила бросившую ей вызов ткачиху и вышивальщицу Арахну?",
			   "В каком море находятся Соловецкие острова?"]
question_13 = ["Кто из наших соотечественников был первым удостоен звания Героя Советского Союза?",
			   "Каким русским императором многие считали загадочного старца Фёдора Кузьмича?",
			   "Какая планета Солнечной системы названа в честь деда древнеримского Юпитера и отца Сатурна?"]
question_14 = ["Что в России 19 века делали в дортуаре?",
			   "Под каким флагом после успешных операций возвращаются в порт подводные лодки Великобритании?",
			   "Какой русский князь осадил столицу Византийской империи и наложил на империю контрибуцию?"]
question_15 = ['Кто из этих философов в 1864 году написал музыку на стихи А. С. Пушкина "Заклинание" и "Зимний вечер"?',
			   "Как назвали первую кимберлитовую трубку, открытую Ларисой Попугаевой 21 августа 1954 года?",
			   "С какой буквы начинаются слова, опубликованные в 16 томе последнего издания Большой Советской Энциклопедии?"]



# Вопрос №1
RETURNED = question(
	1, question_1, 
	"Что растёт на огороде?", 
	"Какое название телеканала верное?", 
	"Сколько ног у паукообразных?", 
	"Пистолет", "Лук", "Пулемёт", "Ракета СС-20", 
	"СТС", "ТСТ", "CCT", "ЖЛОБ", 
	"6", "8", "10", "12", 
	["B", "В"], ["A", "А"], ["B", "В"], 
	True, True, True)


# Вопрос №2
RETURNED = question(
	2, question_2, 
	'Назовите сокращённое название "маршрутного такси".', 
	"Назовите популярного стихотворца.", 
	'Какого персонажа нет в известной считалке "На золотом крыльце сидели"?', 
	"Путёвка", "Курсовка", "Маршрутка", "Ватрушка", 
	"Колотушкин", "Пушкин", "Васькин", "Петькин", 
	"Сапожник", "Король", "Портной", "Крестьянин", 
	["C", "С"], ["B", "В"], ["D", "D"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №3
RETURNED = question(
	3, question_3, 
	'Назовите название популярной телепередачи на 1 канале. "Что? Где?..."', 
	"Какой телеканал существует на самом деле?", 
	"Где, если верить пословице, любопытной Варваре нос оторвали?", 
	"Зачем?", "Как?", "Когда?", "Какой?", 
	"Колесо обозрения", "Карусель", "Американские гонки", "Водное ралли", 
	"В дверях", "На рынке", "На концерте", "На базаре", 
	["C", "С"], ["B", "В"], ["D", "D"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №4
RETURNED = question(
	4, question_4, 
	"Какой отряд птиц не умеет летать?", 
	"Какой предел медицинского градусника?", 
	"Сколько хромосом у среднестатистического человека?", 
	"Воробьинообразные", "Совы", "Страусы", "Журавлеобразные", 
	"41", "42", "43", "44", 
	"44", "45", "46", "47", 
	["C", "С"], ["B", "В"], ["C", "С"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №5
RETURNED = question(
	5, question_5, 
	"Кто из 4-ёх мушкетёров был не назван? Атос, Д'Артаньян, Партос...", 
	"Назовите формулу воды.", 
	"Какую обувь приобрёл к зиме Шарик из мультфильма про Простоквашино?", 
	"Граф Де'ЛаФер", "Арамис", "Кардинал Ришелье", "Бекингем", 
	"H2O", "HO2", "O2H", "OH2", 
	"Валенки", "Кроссовки", "Кеды", "Бутсы", 
	["B", "В"], ["A", "А"], ["C", "С"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №6
RETURNED = question(
	6, question_6, 
	"Назовите годы правления Михаила Фёдоровича Романова.", 
	"Когда произрошло Первое Московское ополчение?", 
	"Когда произшло крещение на Руси?", 
	"1613 - 1645 года", "1615 - 1643 года", "1645 - 1713 года", "1513 - 1545 года", 
	"1612 год", "1611 год", "1610 год", "1609 год", 
	"977 год", "988 год", "978 год", "987 год", 
	["A", "А"], ["B", "В"], ["B", "В"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №7
RETURNED = question(
	7, question_7, 
	"К какому семейству птиц относится снегирь?", 
	"Что испанцы съедают в новогоднюю полночь с каждым ударом часов?", 
	"В какую одежду принято плакать, чтобы вызвать сочувствие?", 
	"Вьюрковые", "Воробьиные", "Голубиные", "Жаворонковые", 
	"Гуайяву", "Ежевику", "Виноградинку", "Гирры", 
	"В рукав", "В фартук", "В жилетку", "В рубашку", 
	["A", "А"], ["C", "С"], ["C", "С"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №8
RETURNED = question(
	8, question_8, 
	"На практике при движении по кривой этот шарик делает 5000 оборотов в минуту, а при движении по прямой более 20000 оборотов в минуту. Где этот шарик находится?", 
	'Как звали почтальона Печкина из мультфильма "Трое из Простоквашино"?', 
	"Каким предметом китайцы стараются не пользоваться в преддверии Нового года, чтобы не разрушить счастья?", 
	"Подшипник", "Шаровой сустав", "Шариковая ручка", "Шаровой двигатель", 
	"Фёдор Иванович", "Игорь Иванович", "Юрий Иванович", "Виктор Иванович", 
	"Мечом", "Вилкой", "Секирой", "Ножом", 
	["C", "С"], ["B", "В"], ["D", "D"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №9
RETURNED = question(
	9, question_9, 
	"Из какого мяса традиционно готовится начинка для чебуреков?", 
	"Изучение соединений какого элемента является основой органической химии?", 
	"Разновидностью какого минерала является горный хрусталь?", 
	"Баранина", "Говядина", "Кура", "Свинина", 
	"Кислород", "Кремний", "Азот", "Углерод", 
	"Кварца", "Алмаза", "Кианита", "Лазурита", 
	["A", "А"], ["D", "D"], ["A", "А"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №10
RETURNED = question(
	10, question_10, 
	"В какое море впадает река Урал?", 
	"Как называется шуточная поэма Пушкина?", 
	"С каким из этих государств не граничит Россия?", 
	"Каспийское", "Чёрное", "Азовское", "Сердиземное", 
	"Домик в Вероне", "Домик с колонной", "Домик в Коломне", "Домик на склоне", 
	"Грузия", "Узбекистан", "Казахстан", "Азербайджан", 
	["B", "В"], ["A", "А"], ["C", "С"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №11
RETURNED = question(
	11, question_11, 
	"Как называется метеорный поток, наблюдаемый ежегодно в ноябре?", 
	"Как называется балет Дмитрия Шостоковича на производственную тематику?", 
	"Какого цвета были первые советские скафандры для космонавтов?", 
	"Максимы", "Леониды", "Гаврилы", "Иваны", 
	"Болт", "Винт", "Шайба", "Гайка", 
	"Жёлтого", "Голубого", "Белого", "Оранжевого", 
	["B", "В"], ["A", "А"], ["D", "D"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №12
RETURNED = question(
	12, question_12, 
	"Чего боится охлофоб?", 
	"В кого богиня Афина превратила бросившую ей вызов ткачиху и вышивальщицу Арахну?", 
	"В каком море находятся Соловецкие острова?", 
	"Змей", "Толпы", "Наказания", "Открытого пространства", 
	"В жабу", "В рыбу", "В паука", "В змею", 
	"Балтийское", "Белое", "Карское", "Баренцево", 
	["B", "В"], ["C", "С"], ["B", "В"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №13
RETURNED = question(
	13, question_13, 
	"Кто из наших соотечественников был первым удостоен звания Героя Советского Союза?", 
	"Каким русским императором многие считали загадочного старца Фёдора Кузьмича?", 
	"Какая планета Солнечной системы названа в честь деда древнеримского Юпитера и отца Сатурна?", 
	"Шмидт", "Ляпидевский", "Чкалов", "Водопьянов", 
	"Александр I", "Павел I", "Николай I", "Александр II", 
	"Нептун", "Меркурий", "Марс", "Уран", 
	["B", "В"], ["A", "А"], ["D", "D"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №14
RETURNED = question(
	14, question_14, 
	"Что в России 19 века делали в дортуаре?", 
	"Под каким флагом после успешных операций возвращаются в порт подводные лодки Великобритании?", 
	"Какой русский князь осадил столицу Византийской империи и наложил на империю контрибуцию?", 
	"Спали", "Ели", "Купались", "Ездили верхом", 
	"Флаг Вильгельма Завоевателя", "Флаг поверженного противника", "Белый флаг", 'Весёлый Роджер', 
	"Олег Вещий", "Ярослав Мудрый", "Владимир Мономах", "Игорь", 
	["A", "А"], ["D", "D"], ["C", "С"], 
	RETURNED[0], RETURNED[1], RETURNED[2])


# Вопрос №15
RETURNED = question(
	4, question_4, 
	'Кто из этих философов в 1864 году написал музыку на стихи А. С. Пушкина "Заклинание" и "Зимний вечер"?', 
	"Как назвали первую кимберлитовую трубку, открытую Ларисой Попугаевой 21 августа 1954 года?", 
	"С какой буквы начинаются слова, опубликованные в 16 томе последнего издания Большой Советской Энциклопедии?", 
	"Шопенгауэр", "Гегель", "Ницше", "Юнг", 
	'"Удачная"', '"Зарница"', '"Мир"', '"Советская"', 
	"Л", "М", "Н", "О", 
	["C", "С"], ["B", "В"], ["B", "В"],  
	RETURNED[0], RETURNED[1], RETURNED[2])