from textwork import *
playing = True

os.system("mode con cols=80")

horiz()
cntt('ПРАВИЛА ИГРЫ')
horiz()
cntt('Добро пожаловать в текстовую игру "Мы - люди этой Земли". Ваша главаня цель - выжить и пройти игру до конца. '
     'В игре 4 главы. Каждая глава озадачивает вас и героев, даёт вам цель для выживания в игре. '
     'В ходе игры будут появляться квесты, загадки и, конечно же, рандом. ')
wait()
cls()

horiz()
cntt('ПРЕДЫСТОРИЯ')
horiz()
cntt('В век постапокалипсиса многие погибли. В живых осталось несколько миллионов человек. А всё из-за той катастрофы в Чернобыле. '
    'Тогда был обычный день, но никто не ожидал взрыва на атомной станции. Всё случилось очень быстро, народ начинал покидать территорию города. '
    'Вся остаточная радиация распространилась по всему миру... Многие люди не справлялись с эпидемией... Они падали в конвульсиях, разрывались на части прямо на ходу. '
    'Или же просто падали от бессилия. Но выжившие начинали превращаться в зомби, ящеров и других мутантов. Прятаться оставшемуся народу было некуда... '
    'Что делать — уже никто не знает... А вы - главный герой Майкл Гехабит. Сможете ли вы выиграть в этой борьбе? Сейчас узнаем...')
wait()

while playing:
    cls()
    horiz()
    cntt('ГЛАВА 1 - КТО ОН?')
    horiz()

    cnt('Погоня от зомби. Диалог между Майклом, Генри и Адамом.')
    wait()
    exit()
